# DBeam_SetTShutAngle

## Description
```pascal
PROCEDURE DBeam_SetTShutAngle(angle : REAL);
```

```python

def vs.DBeam_SetTShutAngle(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight